## The purpose of this Jupyter Notebook is to create a complete list of school coordinates which will be used for all the schools in our datasets from 2016-2020

In [1]:
# import the required library
import pandas as pd

In [2]:
# read "doe_2020" csv file
doe = pd.read_csv("Resources/doe_2020.csv")
doe

,Code,School Name,Street,Suburb,State,Postcode,Postal Street,Postal Suburb,Postal State,Postal Postcode,Latitude,Longitude,Phone,Education Region,Broad Classification,Classification Group,Low Year,High Year
0,5001,ADAM ROAD PRIMARY SCHOOL,HOTCHIN STREET,SOUTH BUNBURY,WA,6230,HOTCHIN STREET,SOUTH BUNBURY,WA,6230,-33.357951,115.635371,08 9796 3000,SOUTH WEST,Primary Schools,PRIMARY SCHOOLS,KIN,Y06
1,1397,AL-HIDAYAH ISLAMIC SCHOOL,CNR HEDLEY ST/NYAMUP WAY,BENTLEY,WA,6102,CNR HEDLEY ST/NYAMUP WAY,BENTLEY,WA,6102,-32.010358,115.911564,08 9351 8593,SOUTH METROPOLITAN,NON-GOVT SCHOOLS,NON-GOVERNMENT,PPR,Y06
2,8001,ALBANY COMMUNITY KINDERGARTEN,136 SERPENTINE ROAD,ALBANY,WA,6330,PO BOX 5670,ALBANY,WA,6332,-35.021460,117.880987,08 9841 1864,SOUTH WEST,Community Kindergartens,COMMUNITY KINDERGARTENS,KIN,KIN
3,5002,ALBANY PRIMARY SCHOOL,SUFFOLK STREET,ALBANY,WA,6330,SUFFOLK STREET,ALBANY,WA,6330,-35.018212,117.891611,08 9844 2860,SOUTH WEST,Primary Schools,PRIMARY SCHOOLS,KIN,Y06
4,6151,ALBANY SECONDARY EDUCATION SUPPORT CENTRE,65 ANSON ROAD,ALBANY,WA,6330,65 ANSON ROAD,ALBANY,WA,6330,-34.990749,117.866867,08 9841 4900,SOUTH WEST,Education Support Centres,EDUCATION SUPPORT,Y07,Y12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1132,1497,YOUTH FUTURES COMMUNITY SCHOOL,59 KEY LARGO DRIVE,CLARKSON,WA,6030,59 KEY LARGO DRIVE,CLARKSON,WA,6030,-31.691100,115.719850,08 9407 9099,NORTH METROPOLITAN,NON-GOVT SCHOOLS,NON-GOVERNMENT,Y09,Y12
1133,4127,YULE BROOK COLLEGE,61 DELLAR ROAD,MADDINGTON,WA,6109,61 DELLAR ROAD,MADDINGTON,WA,6109,-32.047327,116.006462,08 9251 8333,SOUTH METROPOLITAN,High Schools,SECONDARY SCHOOLS,Y07,Y10
1134,5787,YULGA JINNA REMOTE COMMUNITY SCHOOL,YULGA JINNA REMOTE COMMUNITY,YULGA JINNA REMOTE COMMUNITY,WA,6642,VIA MEEKATHARRA,MEEKATHARRA,WA,6642,-25.617306,118.557728,08 9981 2200,MIDWEST,Remote Community Schools,PRIMARY SCHOOLS,KIN,Y07
1135,5217,YULUMA PRIMARY SCHOOL,21 AMBROSE STREET,INNALOO,WA,6018,21 AMBROSE STREET,INNALOO,WA,6018,-31.892268,115.789990,08 9244 5422,NORTH METROPOLITAN,Primary Schools,PRIMARY SCHOOLS,KIN,Y06
1136,5497,YUNA PRIMARY SCHOOL,YUNA-TENINDEWA ROAD,YUNA,WA,6532,PMB 610,GERALDTON PO,WA,6531,-28.326566,115.002648,08 9985 4100,MIDWEST,Primary Schools,PRIMARY SCHOOLS,Y01,Y06

In [3]:
# remove other columns
doe = doe[["School Name", "Suburb", "Longitude", "Latitude"]]
doe

,School Name,Suburb,Longitude,Latitude
0,ADAM ROAD PRIMARY SCHOOL,SOUTH BUNBURY,115.635371,-33.357951
1,AL-HIDAYAH ISLAMIC SCHOOL,BENTLEY,115.911564,-32.010358
2,ALBANY COMMUNITY KINDERGARTEN,ALBANY,117.880987,-35.021460
3,ALBANY PRIMARY SCHOOL,ALBANY,117.891611,-35.018212
4,ALBANY SECONDARY EDUCATION SUPPORT CENTRE,ALBANY,117.866867,-34.990749
...,...,...,...,...
1132,YOUTH FUTURES COMMUNITY SCHOOL,CLARKSON,115.719850,-31.691100
1133,YULE BROOK COLLEGE,MADDINGTON,116.006462,-32.047327
1134,YULGA JINNA REMOTE COMMUNITY SCHOOL,YULGA JINNA REMOTE COMMUNITY,118.557728,-25.617306
1135,YULUMA PRIMARY SCHOOL,INNALOO,115.789990,-31.892268
1136,YUNA PRIMARY SCHOOL,YUNA,115.002648,-28.326566

In [4]:
# rename the "School Name" column name
doe = doe.rename(columns = {"School Name" : "School"})
doe

,School,Suburb,Longitude,Latitude
0,ADAM ROAD PRIMARY SCHOOL,SOUTH BUNBURY,115.635371,-33.357951
1,AL-HIDAYAH ISLAMIC SCHOOL,BENTLEY,115.911564,-32.010358
2,ALBANY COMMUNITY KINDERGARTEN,ALBANY,117.880987,-35.021460
3,ALBANY PRIMARY SCHOOL,ALBANY,117.891611,-35.018212
4,ALBANY SECONDARY EDUCATION SUPPORT CENTRE,ALBANY,117.866867,-34.990749
...,...,...,...,...
1132,YOUTH FUTURES COMMUNITY SCHOOL,CLARKSON,115.719850,-31.691100
1133,YULE BROOK COLLEGE,MADDINGTON,116.006462,-32.047327
1134,YULGA JINNA REMOTE COMMUNITY SCHOOL,YULGA JINNA REMOTE COMMUNITY,118.557728,-25.617306
1135,YULUMA PRIMARY SCHOOL,INNALOO,115.789990,-31.892268
1136,YUNA PRIMARY SCHOOL,YUNA,115.002648,-28.326566

In [5]:
# change the "School" & "Suburb" columns values format to a title format
doe['School'] = doe['School'].str.title()
doe['Suburb'] = doe['Suburb'].str.title()
doe

,School,Suburb,Longitude,Latitude
0,Adam Road Primary School,South Bunbury,115.635371,-33.357951
1,Al-Hidayah Islamic School,Bentley,115.911564,-32.010358
2,Albany Community Kindergarten,Albany,117.880987,-35.021460
3,Albany Primary School,Albany,117.891611,-35.018212
4,Albany Secondary Education Support Centre,Albany,117.866867,-34.990749
...,...,...,...,...
1132,Youth Futures Community School,Clarkson,115.719850,-31.691100
1133,Yule Brook College,Maddington,116.006462,-32.047327
1134,Yulga Jinna Remote Community School,Yulga Jinna Remote Community,118.557728,-25.617306
1135,Yuluma Primary School,Innaloo,115.789990,-31.892268
1136,Yuna Primary School,Yuna,115.002648,-28.326566

In [6]:
# replace some values to correct the spelling to prevent Null values when performing the merge with other Dataframes later on
doe["School"].replace({"Irene Mccormack Catholic College": "Irene McCormack Catholic College",
                       "John Xxiii College": "John XXIII College",
                       "Oneschool Global Wa": "OneSchool Global WA",
                       "Our Lady Of Mercy College": "Our Lady of Mercy College",
                       "Peter Moyes Anglican Community": "Peter Moyes Anglican Community School",
                       "Presbyterian Ladies College": "Presbyterian Ladies' College",
                       "St Andrew'S Grammar": "St Andrew's Grammar",
                       "St Brigid'S College": "St Brigid's College",
                       "St Hilda'S Anglican School For Girls": "St Hilda's Anglican School for Girls",
                       "St Joseph'S College": "St Joseph's College",
                       "St Luke'S College": "St Luke's College",
                       "St Mark'S Anglican Community School": "St Mark's Anglican Community School",
                       "St Mary'S Anglican Girls' School": "St Mary's Anglican Girls' School",
                       "St Stephen'S School": "St Stephen's School - Duncraig",
                       "Swan Valley Anglican Community": "Swan Valley Anglican Community School",
                       "John Curtin College Of The Arts": "John Curtin College of the Arts",
                       "Australian Islamic College - North Of The River": "Australian Islamic College - Dianella",
                       "Australian Islamic College - Perth": "Australian Islamic College - Thornlie",
                       "St George'S Anglican Grammar School": "St George's Anglican Grammar School",
                       "International School Of Western Australia": "International School of Western Australia",
                       "School Of Isolated And Distance Education": "School of Isolated and Distance Education",
                       "Cornerstone Christian College Ltd": "Cornerstone Christian College"                    
                       }, inplace=True)

In [7]:
# create a new Dataframe with new entries to be added to the "doe" Dataframe
doe_update = pd.DataFrame({"School": ["Woodthorpe School", "St Stephen's School - Carramar", "Bunbury John Calvin School"],
                           "Suburb": ["Willetton", "Carramar", "Carey Park"],
                           "Longitude": [115.90172, 115.78828, 115.64956],
                           "Latitude": [-32.05654, -31.71704, -33.35097]
                            })
doe_update

                           School      Suburb  Longitude  Latitude
0               Woodthorpe School   Willetton  115.90172 -32.05654
1  St Stephen's School - Carramar    Carramar  115.78828 -31.71704
2      Bunbury John Calvin School  Carey Park  115.64956 -33.35097

In [8]:
# append "doe_update" Dataframe to "doe" Dataframe
doe = doe.append(doe_update)
doe

,School,Suburb,Longitude,Latitude
0,Adam Road Primary School,South Bunbury,115.635371,-33.357951
1,Al-Hidayah Islamic School,Bentley,115.911564,-32.010358
2,Albany Community Kindergarten,Albany,117.880987,-35.021460
3,Albany Primary School,Albany,117.891611,-35.018212
4,Albany Secondary Education Support Centre,Albany,117.866867,-34.990749
...,...,...,...,...
1135,Yuluma Primary School,Innaloo,115.789990,-31.892268
1136,Yuna Primary School,Yuna,115.002648,-28.326566
0,Woodthorpe School,Willetton,115.901720,-32.056540
1,St Stephen's School - Carramar,Carramar,115.788280,-31.717040
2,Bunbury John Calvin School,Carey Park,115.649560,-33.350970

In [9]:
# save the "doe" dataframe to a CSV file
doe.to_csv("Resources/school_coordinates.csv", index = False)